qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_ll_flash.h
/**
  ******************************************************************************
  * @file    py32f403_ll_flash.h
  * @author  MCU Application Team
  * @brief   Header file of FLASH LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef PY32F403_LL_FLASH_H
#define PY32F403_LL_FLASH_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32f4xx.h"



/** @addtogroup PY32F403_LL_Driver
  * @{
  */

#if defined (FLASH)

/** @defgroup FLASH_LL FLASH
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/** @defgroup FLASH_LL_Exported_Constants FLASH Exported Constants
  * @{
  */

/** @defgroup FLASH_LL_EC_IWDGMODE IWDG Mode
  * @{
  */
#define LL_FLASH_IWDG_MODE_HW          (0x00000000U)                                         /*!< Hardware IWDG selected */
#define LL_FLASH_IWDG_MODE_SW          (FLASH_OPTR_IWDG_SW)                                  /*!< Software IWDG selected */
/**
  * @}
  */


/** @defgroup FLASH_LL_EC_STOP_RST_MODE STOP RST Mode
  * @{
  */
#define LL_FLASH_STOP_RST              (0x00000000U)                                         /*!< Reset generated when entering Stop mode */
#define LL_FLASH_STOP_NORST            (FLASH_OPTR_NRST_STOP)                                /*!< No reset generated when entering Stop mode */
/**
  * @}
  */

/** @defgroup FLASH_LL_EC_STANDBY_RST_MODE STANDBY RST Mode
  * @{
  */
#define LL_FLASH_STANDBY_RST           (0x00000000U)                                         /*!< Reset generated when entering Standby mode */
#define LL_FLASH_STANDBY_NORST         (FLASH_OPTR_NRST_STDBY)                               /*!< No reset generated when entering Standby mode */
/**
  * @}
  */

/** @defgroup FLASH_LL_EC_RDP RDP Mode
  * @{
  */
#define LL_FLASH_RDP_LEVEL_0         ((uint8_t)0xAAU)
#define LL_FLASH_RDP_LEVEL_1         ((uint8_t)0x55U)

/**
  * @}
  */

/** @defgroup FLASH_LL_EC_WRP Write Protection
  * @{
  */
#define LL_FLASH_WRP_DISABLE          ((uint32_t)0x00000000)         /* Write protection disable */
#define LL_FLASH_WRP_BLOCK_0          ((uint32_t)FLASH_WRPR_WRP_0)   /* Write protection of Block0 */
#define LL_FLASH_WRP_BLOCK_1          ((uint32_t)FLASH_WRPR_WRP_1)   /* Write protection of Block1 */
#define LL_FLASH_WRP_BLOCK_2          ((uint32_t)FLASH_WRPR_WRP_2)   /* Write protection of Block2 */
#define LL_FLASH_WRP_BLOCK_3          ((uint32_t)FLASH_WRPR_WRP_3)   /* Write protection of Block3 */
#define LL_FLASH_WRP_BLOCK_4          ((uint32_t)FLASH_WRPR_WRP_4)   /* Write protection of Block4 */
#define LL_FLASH_WRP_BLOCK_5          ((uint32_t)FLASH_WRPR_WRP_5)   /* Write protection of Block5 */
#define LL_FLASH_WRP_BLOCK_6          ((uint32_t)FLASH_WRPR_WRP_6)   /* Write protection of Block6 */
#define LL_FLASH_WRP_BLOCK_7          ((uint32_t)FLASH_WRPR_WRP_7)   /* Write protection of Block7 */
#define LL_FLASH_WRP_BLOCK_8          ((uint32_t)FLASH_WRPR_WRP_8)   /* Write protection of Block8 */
#define LL_FLASH_WRP_BLOCK_9          ((uint32_t)FLASH_WRPR_WRP_9)   /* Write protection of Block9 */
#define LL_FLASH_WRP_BLOCK_10         ((uint32_t)FLASH_WRPR_WRP_10)  /* Write protection of Block10 */
#define LL_FLASH_WRP_BLOCK_11         ((uint32_t)FLASH_WRPR_WRP_11)  /* Write protection of Block11 */

#define LL_FLASH_WRP_Pages0to127      ((uint32_t)FLASH_WRPR_WRP_0)   /* Write protection from page0    to page127 */
#define LL_FLASH_WRP_Pages128to255    ((uint32_t)FLASH_WRPR_WRP_1)   /* Write protection from page128  to page255 */
#define LL_FLASH_WRP_Pages256to383    ((uint32_t)FLASH_WRPR_WRP_2)   /* Write protection from page256  to page383 */
#define LL_FLASH_WRP_Pages384to511    ((uint32_t)FLASH_WRPR_WRP_3)   /* Write protection from page384  to page511 */
#define LL_FLASH_WRP_Pages512to639    ((uint32_t)FLASH_WRPR_WRP_4)   /* Write protection from page512  to page639 */
#define LL_FLASH_WRP_Pages640to767    ((uint32_t)FLASH_WRPR_WRP_5)   /* Write protection from page640  to page767 */
#define LL_FLASH_WRP_Pages768to895    ((uint32_t)FLASH_WRPR_WRP_6)   /* Write protection from page768  to page895 */
#define LL_FLASH_WRP_Pages896to1023   ((uint32_t)FLASH_WRPR_WRP_7)   /* Write protection from page896  to page1023 */
#define LL_FLASH_WRP_Pages1024to1151  ((uint32_t)FLASH_WRPR_WRP_8)   /* Write protection from page1024 to page1151 */
#define LL_FLASH_WRP_Pages1152to1279  ((uint32_t)FLASH_WRPR_WRP_9)   /* Write protection from page1152 to page1279 */
#define LL_FLASH_WRP_Pages1280to1407  ((uint32_t)FLASH_WRPR_WRP_10)  /* Write protection from page1280 to page1407 */
#define LL_FLASH_WRP_Pages1408to1535  ((uint32_t)FLASH_WRPR_WRP_11)  /* Write protection from page1408 to page1535 */

