qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_ll_flash.h
  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}

/**
  * @}
  */

/** @defgroup FLASH_LL_EF_WRP_Management WRP Management
  * @{
  */

/**
  * @brief  Set WRP Address
  * @rmtoll WRPR        WRP             LL_FLASH_SetWRPRAddress
  * @param  FLASHx FLASH Instance
  * @param  Address This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_WRP_DISABLE
  *         @arg @ref LL_FLASH_WRP_BLOCK_0
  *         @arg @ref LL_FLASH_WRP_BLOCK_1
  *         @arg @ref LL_FLASH_WRP_BLOCK_2
  *         @arg @ref LL_FLASH_WRP_BLOCK_3
  *         @arg @ref LL_FLASH_WRP_BLOCK_4
  *         @arg @ref LL_FLASH_WRP_BLOCK_5
  *         @arg @ref LL_FLASH_WRP_BLOCK_6
  *         @arg @ref LL_FLASH_WRP_BLOCK_7
  *         @arg @ref LL_FLASH_WRP_BLOCK_8
  *         @arg @ref LL_FLASH_WRP_BLOCK_9
  *         @arg @ref LL_FLASH_WRP_BLOCK_10
  *         @arg @ref LL_FLASH_WRP_BLOCK_11
  *         @arg @ref LL_FLASH_WRP_Pages0to127
  *         @arg @ref LL_FLASH_WRP_Pages128to255
  *         @arg @ref LL_FLASH_WRP_Pages256to383
  *         @arg @ref LL_FLASH_WRP_Pages384to511
  *         @arg @ref LL_FLASH_WRP_Pages512to639
  *         @arg @ref LL_FLASH_WRP_Pages640to767
  *         @arg @ref LL_FLASH_WRP_Pages768to895
  *         @arg @ref LL_FLASH_WRP_Pages896to1023
  *         @arg @ref LL_FLASH_WRP_Pages1024to1151
  *         @arg @ref LL_FLASH_WRP_Pages1152to1279
  *         @arg @ref LL_FLASH_WRP_Pages1280to1407
  *         @arg @ref LL_FLASH_WRP_Pages1408to1535
  *         @arg @ref LL_FLASH_WRP_AllPages
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_SetWRPAddress(FLASH_TypeDef *FLASHx,uint32_t Address)
{
  MODIFY_REG(FLASHx->WRPR, FLASH_WRPR_WRP , ((~(Address)) & FLASH_WRPR_WRP));
}

/**
  * @brief  Get WRP Address
  * @rmtoll WRPR        WRP             LL_FLASH_GetWRPAddress
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_FLASH_WRP_DISABLE
  *         @arg @ref LL_FLASH_WRP_BLOCK_0
  *         @arg @ref LL_FLASH_WRP_BLOCK_1
  *         @arg @ref LL_FLASH_WRP_BLOCK_2
  *         @arg @ref LL_FLASH_WRP_BLOCK_3
  *         @arg @ref LL_FLASH_WRP_BLOCK_4
  *         @arg @ref LL_FLASH_WRP_BLOCK_5
  *         @arg @ref LL_FLASH_WRP_BLOCK_6
  *         @arg @ref LL_FLASH_WRP_BLOCK_7
  *         @arg @ref LL_FLASH_WRP_BLOCK_8
  *         @arg @ref LL_FLASH_WRP_BLOCK_9
  *         @arg @ref LL_FLASH_WRP_BLOCK_10
  *         @arg @ref LL_FLASH_WRP_BLOCK_11
  *         @arg @ref LL_FLASH_WRP_Pages0to127
  *         @arg @ref LL_FLASH_WRP_Pages128to255
  *         @arg @ref LL_FLASH_WRP_Pages256to383
  *         @arg @ref LL_FLASH_WRP_Pages384to511
  *         @arg @ref LL_FLASH_WRP_Pages512to639
  *         @arg @ref LL_FLASH_WRP_Pages640to767
  *         @arg @ref LL_FLASH_WRP_Pages768to895
  *         @arg @ref LL_FLASH_WRP_Pages896to1023
  *         @arg @ref LL_FLASH_WRP_Pages1024to1151
  *         @arg @ref LL_FLASH_WRP_Pages1152to1279
  *         @arg @ref LL_FLASH_WRP_Pages1280to1407
  *         @arg @ref LL_FLASH_WRP_Pages1408to1535
  *         @arg @ref LL_FLASH_WRP_AllPages
  */
__STATIC_INLINE uint32_t LL_FLASH_GetWRPAddress(FLASH_TypeDef *FLASHx)
{
  return ((~(READ_BIT(FLASHx->WRPR, FLASH_WRPR_WRP))) & FLASH_WRPR_WRP);
}
/**
  * @}
  */

/** @defgroup FLASH_LL_EF_OPTR_Management OPTR Management
  * @{
  */
/**
  * @brief  Set Optr
  * @rmtoll OPTR            NRST_STDBY           LL_FLASH_SetOPTR
  * @rmtoll OPTR            NRST_STOP            LL_FLASH_SetOPTR
  * @rmtoll OPTR            IWDG_SW              LL_FLASH_SetOPTR
  * @rmtoll OPTR            RDP                  LL_FLASH_SetOPTR
  * @param  FLASHx FLASH Instance
  * @param  NRSTStandby This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_STOP_RST
  *         @arg @ref LL_FLASH_STOP_NORST
  * @param  NRSTStop This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_STANDBY_RST
  *         @arg @ref LL_FLASH_STANDBY_NORST
  * @param  IWDGMode This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_IWDG_MODE_HW
  *         @arg @ref LL_FLASH_IWDG_MODE_SW
  * @param  RDPLevel This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_RDP_LEVEL_0
  *         @arg @ref LL_FLASH_RDP_LEVEL_1
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_SetOPTR(FLASH_TypeDef *FLASHx,uint32_t NRSTStandby,uint32_t NRSTStop,uint32_t IWDGMode,uint32_t RDPLevel)
{
  MODIFY_REG(FLASHx->OPTR, (FLASH_OPTR_NRST_STOP | FLASH_OPTR_NRST_STDBY | FLASH_OPTR_IWDG_SW | FLASH_OPTR_RDP), (NRSTStandby | NRSTStop | IWDGMode | RDPLevel));
}

/**
  * @brief Get IWDG Mode
  * @rmtoll OPTR        IWDG_SW          LL_FLASH_GetIWDGMode
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_IWDG_MODE_HW
  *         @arg @ref LL_FLASH_IWDG_MODE_SW
  */
__STATIC_INLINE uint32_t LL_FLASH_GetIWDGMode(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR, FLASH_OPTR_IWDG_SW);
}

/**
  * @brief Get Stop Reset
  * @rmtoll OPTR        NRST_STOP          LL_FLASH_GetSTOPReset
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_STOP_RST
  *         @arg @ref LL_FLASH_STOP_NORST
  */
__STATIC_INLINE uint32_t LL_FLASH_GetSTOPReset(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR, FLASH_OPTR_NRST_STOP);
}

/**
  * @brief Get Standby Reset
  * @rmtoll OPTR        NRST_STDBY          LL_FLASH_GetSTANDBYReset
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_STANDBY_RST
  *         @arg @ref LL_FLASH_STANDBY_NORST
  */
__STATIC_INLINE uint32_t LL_FLASH_GetSTANDBYReset(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR, FLASH_OPTR_NRST_STDBY);
}

/**
  * @brief Get RDP Level
  * @rmtoll OPTR        RDP          LL_FLASH_GetRDP
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_RDP_LEVEL_0
  *         @arg @ref LL_FLASH_RDP_LEVEL_1
  */
__STATIC_INLINE uint32_t LL_FLASH_GetRDP(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR, FLASH_OPTR_RDP);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* defined (FLASH) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* PY32F403_LL_FLASH_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
